---
type: VendorIdAttribute
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 2
tags: [revit-api, class]
---

# VendorIdAttribute

`Autodesk.Revit.DB.Macros.VendorIdAttribute` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VendorIdAttribute | 2012 | `public VendorIdAttribute ( string vendorIdStr )` |
| Property | Value | 2012 | `public string Value { get ; }` |